"""
Задание №5
✔ Напишите программу, которая решает квадратные уравнения даже если
дискриминант отрицательный.
✔ Используйте комплексные числа для извлечения квадратного корня.
"""

a, b, c = 3, 4, 5
d = b ** 2 - 4 * a * с
print(d)

# a + b *
# a + b действительные числа, i - мнимая единица
